In [1]:
import pandas as pd

In [2]:
#it reading a datset to specify that the datasetdoes not have a header row and if donot given header=none the dataset treated the frist row is columns name
df_1=pd.read_csv("C:/Users/admin/Downloads/stud_1.csv",header=None)

In [3]:
df_1.columns=["std_name","std_rollno"]

In [4]:
df_1

    std_name  std_rollno
0     vineet           1
1     hisham           2
2        raj           3
3      ajeet           4
4     sujit            5
5     ramesh           6
6      priya           7
7   priyanka           8
8     suresh           9
9     ritesh          10
10    hitesh          11
11     jatin          12
12   chitesh          13
13     suman          14
14     raman          15
15      aman          16
16      ravi          17
17    shravi          18
18    chavvi          19
19  himanshu          20

In [5]:
df_2=pd.read_csv("C:/Users/admin/Downloads/result.csv",header=None)

In [6]:
df_2.columns=["std_rollno","Results"]

In [7]:
df_2

    std_rollno Results
0            1    fail
1            2    fail
2            3    pass
3            4    pass
4            5    fail
5            6    pass
6            7    fail
7            8    pass
8            9    pass
9           10    pass
10          11    pass
11          12    fail
12          13    fail
13          14    fail
14          15    pass
15          16    pass
16          17    pass
17          18    pass
18          19    pass
19          20    fail

In [8]:
merged_df=pd.merge(df_1,df_2,on ='std_rollno')

In [9]:
merged_df

    std_name  std_rollno Results
0     vineet           1    fail
1     hisham           2    fail
2        raj           3    pass
3      ajeet           4    pass
4     sujit            5    fail
5     ramesh           6    pass
6      priya           7    fail
7   priyanka           8    pass
8     suresh           9    pass
9     ritesh          10    pass
10    hitesh          11    pass
11     jatin          12    fail
12   chitesh          13    fail
13     suman          14    fail
14     raman          15    pass
15      aman          16    pass
16      ravi          17    pass
17    shravi          18    pass
18    chavvi          19    pass
19  himanshu          20    fail

In [10]:
merged_df.to_csv("C:/Users/admin/Desktop/K.ANUSHA/students_dataset.csv")

In [10]:
#finding the pass student in exam
pass_students=merged_df.loc[merged_df['Results']=='pass','std_name']

In [11]:
pass_students

2          raj
3        ajeet
5       ramesh
7     priyanka
8       suresh
9       ritesh
10      hitesh
14       raman
15        aman
16        ravi
17      shravi
18      chavvi
Name: std_name, dtype: object

In [12]:
df=merged_df[merged_df['Results']=='pass'].count()

In [18]:
df2=merged_df[merged_df['Results']=='fail'].count()

In [79]:
df

std_name      12
std_rollno    12
Results       12
dtype: int64

In [19]:
df2

std_name      8
std_rollno    8
Results       8
dtype: int64

In [80]:
#value_counts()is used to count the occurrences of each unique value in column
students_counts=merged_df['Results'].value_counts()

In [81]:
students_counts

pass    12
fail     8
Name: Results, dtype: int64

In [96]:
sorted_student_names=merged_df.sort_values('std_name')

In [94]:
student_names

3        ajeet
15        aman
18      chavvi
12     chitesh
19    himanshu
1       hisham
10      hitesh
11       jatin
6        priya
7     priyanka
2          raj
14       raman
5       ramesh
16        ravi
9       ritesh
17      shravi
4       sujit
13       suman
8       suresh
0       vineet
Name: std_name, dtype: object